tap "aws/tap"
tap "homebrew/bundle"
brew "python@3.11"
brew "docutils"
brew "act"
brew "aria2"
brew "awscli"
brew "bandwhich"
brew "bat"
brew "dive"
brew "dolphie"
brew "duf"
brew "glib"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "gitui"
brew "git-delta"
brew "glances"
brew "gnu-sed"
brew "gping"
brew "grep"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "jq"
brew "lazydocker"
brew "neovim"
brew "node"
brew "node-build"
brew "nodenv"
brew "nvtop"
brew "oath-toolkit"
brew "progressline"
brew "pug"
brew "ripgrep"
brew "ruby-build"
brew "rbenv"
brew "serpl"
brew "starship"
brew "tabiew"
brew "terraformer"
brew "tfenv"
brew "tflint"
brew "thefuck"
brew "tldr"
brew "yarn"
brew "zoxide"
cask "balenaetcher"
cask "chatgpt"
cask "cyberduck"
cask "deepl"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "font-hackgen-nerd"
cask "google-chrome"
cask "notion"
cask "raycast"
cask "session-manager-plugin"
cask "slack"
cask "stats"
cask "tableplus"
cask "via"
cask "visual-studio-code"
cask "vivaldi"
cask "warp"
cask "wezterm"
cask "zoom"
cask "zulip"
