# ==========================================
# CLI Tools
# ==========================================

## AI
brew "aichat"                     # All-in-one AI-Powered CLI Chat & Copilot | https://aistudio.google.com/app/apikey
brew "aicommit2"                  # Reactive CLI that generates commit messages for Git and Jujutsu with AI
brew "omnara"                     # Talk to Your AI Agents from Anywhere
brew "opencode"                   # AI coding agent, built for the terminal
brew "tgpt"                       # AI Chatbots in terminal without needing API keys

## API
brew "httpie"                     # User-friendly cURL replacement (command-line HTTP client)
brew "httptap"                    # HTTP request visualizer with phase-by-phase timing breakdown
brew "openapi-tui"                # TUI to list, browse and run APIs defined with openapi spec
brew "posting"                    # Modern API client that lives in your terminal

## Benchmark
brew "hyperfine"                  # Command-line benchmarking tool

## Cloud
brew "awscli"                     # Official Amazon AWS command-line interface
brew "granted"                    # Easiest way to access your cloud

## Database
brew "dblab"                      # Database client every command-line junkie deserves
brew "harlequin"                  # Easy, fast, and beautiful database client for the terminal
brew "lazysql"                    # Cross-platform TUI database management tool
brew "tabiew"                     # TUI to view and query tabular files (CSV,TSV, Parquet, etc.)

## Dev
brew "act"                        # Run your GitHub Actions locally
brew "claudekit"                  # Intelligent guardrails and workflow automation for Claude Code
brew "code2prompt"                # CLI tool to convert your codebase into a single LLM prompt
brew "e2b"                        # CLI to manage E2B sandboxes and templates
brew "fjira"                      # Fuzzy-find cli jira interface
brew "jiratui"                    # Textual User Interface for interacting with Atlassian Jira from your shell
brew "mise"                       # Polyglot runtime manager (asdf rust clone)
brew "neovim"                     # Ambitious Vim-fork focused on extensibility and agility
brew "pieces-cli"                 # Command-line tool for Pieces.app
brew "scc"                        # Fast and accurate code counter with complexity and COCOMO estimates
brew "shortest"                   # AI-powered natural language end-to-end testing framework
brew "specify"                    # Toolkit to help you get started with Spec-Driven Development
brew "tdd-guard"                  # Automated TDD enforcement for Claude Code
brew "tweakcc"                    # Customize your Claude Code themes, thinking verbs, and more

## DevOps
brew "dive"                       # Tool for exploring each layer in a docker image
brew "lazydocker"                 # Lazier way to manage everything docker
brew "lazyssh"                    # Terminal-based SSH manager
brew "pug"                        # Drive terraform at terminal velocity
brew "terraformer"                # CLI tool to generate terraform files from existing infrastructure
brew "tfenv"                      # Terraform version manager inspired by rbenv
brew "tflint"                     # Linter for Terraform files

## Doc
brew "glow"                       # Render markdown on the CLI
brew "gocheat"                    # TUI Cheatsheet for keybindings, hotkeys and more
brew "qman"                       # Modern man page viewer
brew "slides"                     # Terminal based presentation tool
brew "tlrc"                       # Official tldr client written in Rust

## FileManager
brew "aria2"                      # Download with resuming and segmented downloading
brew "bat"                        # Clone of cat(1) with syntax highlighting and Git integration
brew "eza"                        # Modern, maintained replacement for ls
brew "fd"                         # Simple, fast and user-friendly alternative to find
brew "filebrowser"                # Web File Browser
brew "fzf"                        # Command-line fuzzy finder written in Go
brew "yazi"                       # Blazing fast terminal file manager written in Rust, based on async I/O
brew "zoxide"                     # Shell extension to navigate your filesystem faster

## Git
brew "gh"                         # GitHub command-line tool
brew "ghq"                        # Remote repository management made easy
brew "git"                        # Distributed revision control system
brew "git-delta"                  # Syntax-highlighting pager for git and diff output
brew "gitui"                      # Blazing fast terminal-ui for git written in rust

## Media
brew "spotify_player"             # Command driven spotify player
brew "tut"                        # TUI for Mastodon with vim inspired keys

## MCP
brew "chrome-devtools-mcp"        # MCP server for Chrome DevTools Protocol
brew "mcp-get"                    # CLI for discovering, installing, and managing MCP servers
brew "mcp-grafana"                # MCP server for Grafana
brew "mcpm"                       # Open source, community-driven MCP server and client manager
brew "notion-mcp-server"          # MCP Server for Notion
brew "playwright-mcp"             # MCP server for Playwright
brew "rails-mcp-server"           # MCP server for Ruby on Rails
brew "terraform-mcp-server"       # MCP server for Terraform

## Monitor
brew "bandwhich"                  # Terminal bandwidth utilization tool
brew "duf"                        # Disk Usage/Free Utility - a better 'df' alternative
brew "dust"                       # More intuitive version of du in rust
brew "fastfetch"                  # Like neofetch, but much faster because written mostly in C
brew "glances"                    # Alternative to top/htop
brew "htop"                       # Improved top (interactive process viewer)
brew "hwatch"                     # Modern alternative to the watch command
brew "nvtop"                      # Interactive GPU process monitor
brew "procs"                      # Modern replacement for ps written in Rust
brew "progressline"               # Track commands progress in a compact one-line format
brew "tailspin"                   # Log file highlighter

## Network
brew "gping"                      # Ping, but with a graph

## Search
brew "grep"                       # GNU grep, egrep and fgrep
brew "igrep"                      # Interactive grep
brew "jless"                      # Command-line pager for JSON data
brew "jq"                         # Lightweight and flexible command-line JSON processor
brew "jqp"                        # TUI playground to experiment and play with jq
brew "ripgrep"                    # Search tool like grep and The Silver Searcher
brew "serpl"                      # Simple terminal UI for search and replace

## Security
brew "oath-toolkit"               # Tools for one-time password authentication systems
brew "radare2"                    # Reverse engineering framework

## Shell
brew "fish"                       # User-friendly command-line shell for UNIX-like operating systems
brew "starship"                   # Cross-shell prompt for astronauts
brew "thefuck"                    # Programmatically correct mistyped console commands
brew "zellij"                     # Pluggable terminal workspace, with terminal multiplexer as the base feature

## Util
brew "gnu-sed"                    # GNU implementation of the famous stream editor
brew "x-cmd"                      # Bootstrap 1000+ command-line tools in seconds

# ==========================================
# GUI Applications
# ==========================================

## AI
cask "aionui"                     # GUI for Gemini CLI
cask "aqua-voice"                 # Voice AI interface
cask "chatgpt"                    # OpenAI's ChatGPT desktop app
cask "claude"                     # Anthropic's Claude AI desktop app
cask "claude-code"                # Claude Code CLI tool
cask "codex"                      # OpenAI's coding agent that runs in your terminal
cask "cursor"                     # AI-first code editor
cask "deepchat"                   # AI-powered chat application
cask "emdash"                     # UI for running multiple coding agents in parallel
cask "epicenter-whispering"       # Audio transcription that works with local and cloud models
cask "handy"                      # Speech to text application
cask "hotovo-aider-desk"          # Desktop GUI for Aider AI pair programming
cask "lm-studio"                  # Run local LLMs on your computer
cask "nao"                        # AI assistant
cask "witsy"                      # AI assistant for macOS

## Browser
cask "browseros"                  # Open-source agentic browser
cask "chatgpt-atlas"              # OpenAI's official browser with ChatGPT built in
cask "firefox"                    # Web browser
cask "google-chrome"              # Web browser
cask "strawberry"                 # AI-powered web browser
cask "vivaldi"                    # Web browser focusing on customization and control

## Chat
cask "discord"                    # Voice and text chat software
cask "slack"                      # Team communication and collaboration software
cask "zoom"                       # Video communication and virtual meeting platform
cask "zulip"                      # Team chat application

## Design
cask "figma"                      # Collaborative interface design tool

## Dev
cask "devknife"                   # Collection of handy developer tools
cask "docker"                     # Pack, ship and run any application as a lightweight container
cask "opcode"                     # GUI app and toolkit for Claude Code
cask "sculptor"                   # GUI for Claude Code
cask "session-manager-plugin"     # Plugin for AWS CLI to start and end sessions
cask "stravu-crystal"             # Run multiple Claude Code instances simultaneously using git worktrees
cask "tableplus"                  # Native GUI tool for relational databases
cask "trae"                       # Menu bar app for Traefik reverse proxy
cask "via"                        # Keyboard configurator
cask "visual-studio-code"         # Open-source code editor
cask "warp"                       # Rust-based terminal
cask "wezterm"                    # GPU-accelerated cross-platform terminal emulator

## Media
cask "obs"                        # Open-source software for live streaming and screen recording
cask "stability-matrix"           # Multi-platform package manager for Stable Diffusion

## Note
cask "notion"                     # App to write, plan, collaborate, and get organized
cask "obsidian"                   # Knowledge base that works on top of a local folder of plain text Markdown files

## Productivity
cask "blankie"                    # Ambient sound mixer for creating custom soundscapes
cask "clariti"                    # Focus and relaxation soundscapes
cask "deepl"                      # Translation app
cask "raycast"                    # Control your tools with a few keystrokes

## Storage
cask "cyberduck"                  # Server and cloud storage browser

## System
cask "balenaetcher"               # Flash OS images to SD cards & USB drives
cask "block-goose"                # Lightweight ad blocker
cask "font-hackgen-nerd"          # HackGen Nerd Font
cask "MonitorControl"             # Control external display brightness & volume
cask "stats"                      # System monitor for the menu bar
cask "ui-tars"                    # UI automation tool
cask "void"                       # Menu bar utility that hides icons
