brew "act"
brew "aichat" # https://aistudio.google.com/app/apikey
brew "aria2"
brew "awscli"
brew "bandwhich"
brew "bat"
brew "code2prompt"
brew "codex"
brew "dblab"
brew "dive"
brew "duf"
brew "dust"
brew "e2b"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "gitui"
brew "git-delta"
brew "glances"
brew "glow"
brew "gnu-sed"
brew "gping"
brew "grep"
brew "harlequin"
brew "htop"
brew "httpie"
brew "hwatch"
brew "hyperfine"
brew "jless"
brew "jq"
brew "lazydocker"
brew "lazysql"
brew "mcpm"
brew "neovim"
brew "node"
brew "node-build"
brew "nodenv"
brew "nvtop"
brew "oath-toolkit"
brew "openapi-tui"
brew "pieces-cli"
brew "posting"
brew "procs"
brew "progressline"
brew "pug"
brew "radare2"
brew "ripgrep"
brew "ruby-build"
brew "rbenv"
brew "scc"
brew "serpl"
brew "slides"
brew "spotify_player"
brew "starship"
brew "tabiew"
brew "tailspin"
brew "terraformer"
brew "tfenv"
brew "tflint"
brew "tgpt"
brew "thefuck"
brew "tlrc"
brew "tut"
brew "x-cmd"
brew "yazi"
brew "zellij"
brew "zoxide"
cask "aqua-voice"
cask "balenaetcher"
cask "blankie"
cask "block-goose"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "cursor"
cask "cyberduck"
cask "deepchat"
cask "deepl"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "font-hackgen-nerd"
cask "google-chrome"
cask "MonitorControl"
cask "nao"
cask "notion"
cask "raycast"
cask "session-manager-plugin"
cask "slack"
cask "stability-matrix"
cask "stats"
cask "tableplus"
cask "trae"
cask "via"
cask "visual-studio-code"
cask "vivaldi"
cask "void"
cask "warp"
cask "wezterm"
cask "windsurf"
cask "witsy"
cask "zoom"
cask "zulip"
